Tekla.Structures.Model.RebarGuideline.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.RebarGuideline.SelectInstance(System.Int32)
The select instance.
id:
The id.
Returns:
The System.Boolean.

Tekla.Structures.Model.RebarGuideline.ToStruct(Tekla.Structures.ModelInternal.dotGuideline_t@)
The to struct.
dotGuideline:
The dot guideline.

Tekla.Structures.Model.RebarGuideline.FromStruct(Tekla.Structures.ModelInternal.dotGuideline_t@)
The from struct.
dotGuideline:
The dot guideline.